pub const UNITS_LENGTH: &[(f64, &str)] = &[(1.0, "м"), (0.01, "см"), (0.001, "мм"), (0.0254, "дюйм")];
pub const UNITS_PRESSURE: &[(f64, &str)] = &[
    (1.0, "Па"),
    (1000.0, "кПа"),
    (100000.0, "бар"),
    (1000000.0, "МПа"),
    (101325.0, "атм"),
    (98066.5, "кгс/см²"),
    (6894.757, "psi"),
    (9806.65, "м.в.ст."),
    (133.322, "мм рт.ст."),
];
pub const UNITS_FLOW: &[(f64, &str)] = &[
    (1.0, "м³/с"),
    (0.001, "л/с"),
    (1.0 / 60000.0, "л/мин"),
    (1.0 / 3600.0, "м³/ч"),
    (3.78541 / 60000.0, "GPM"),
];
pub const UNITS_KV: &[(f64, &str)] = &[
    (1.0, "Kv (м³/ч)"),
    (0.865, "Cv (US gpm)"), // 1 Cv = 0.865 Kv
];
pub const UNITS_NONE: &[(f64, &str)] = &[(1.0, "")];
